export default [
  {
    id: "q1",
    text: "다음 중 React.js를 가장 잘 설명하는 정의는 무엇인가요?",
    answers: [
      "선언적 코드를 사용하여 사용자 인터페이스를 구축하는 데 도움을 주는 라이브러리입니다.",
      "웹 애플리케이션에서 상태를 관리하기 위한 라이브러리입니다.",
      "명령형 코드를 사용하여 사용자 인터페이스를 구축하는 데 도움을 주는 프레임워크입니다.",
      "모바일 애플리케이션을 구축하는 데 사용되는 라이브러리입니다.",
    ],
  },
  {
    id: "q2",
    text: "React hooks는 어떤 목적을 하는데 사용되나요?",
    answers: [
      "함수형 컴포넌트에서 상태 및 기타 React 기능을 사용할 수 있도록 하는 것입니다.",
      "React 애플리케이션에서 반응형 레이아웃을 생성하는 데 사용됩니다.",
      "애플리케이션 내에서 오류를 처리하는 데 사용됩니다.",
      "글로벌 상태를 관리하기 위한 Redux 라이브러리의 일부입니다.",
    ],
  },
  {
    id: "q3",
    text: "JSX는 무엇인가요?",
    answers: [
      "JavaScript에 HTML과 유사한 구문을 추가하는 JavaScript 확장입니다.",
      "동적 사용자 인터페이스를 구축하기 위한 JavaScript 라이브러리입니다.",
      "React 전용으로 명시적으로 만들어진 특정 HTML 버전입니다.",
      "React 애플리케이션에서 HTTP 요청을 만들기 위한 도구입니다.",
    ],
  },
  {
    id: "q4",
    text: "React에서 컴포넌트를 생성하는 가장 일반적인 방법은 무엇인가요?",
    answers: [
      "렌더링 가능한 값을 반환하는 JavaScript 함수를 정의함으로써입니다.",
      "JavaScript에서 사용자 정의 HTML 태그를 정의함으로써입니다.",
      ".jsx 확장자를 가진 파일을 생성함으로써입니다.",
      '"new" 키워드를 사용하여 컴포넌트 이름 뒤에 이어지는 방법으로 생성함으로써입니다.',
    ],
  },
  {
    id: "q5",
    text: '"React state"은 무엇을 의미하나요?',
    answers: [
      "컴포넌트 내의 값들을 보유하고 해당 값이 변경될 때 컴포넌트를 렌더링할 수 있는 객체입니다.",
      "React 컴포넌트가 있는 라이프사이클 단계입니다.",
      "React 애플리케이션의 전반적인 상태를 나타내며 모든 프롭스 및 컴포넌트를 포함합니다.",
      "React 애플리케이션에서 글로벌 상태를 관리하기 위한 라이브러리입니다.",
    ],
  },
  {
    id: "q6",
    text: "React 앱에서 일반적으로 목록 내용을 렌더링하는 방법은 무엇인가요?",
    answers: [
      "map() 메서드를 사용하여 데이터 배열을 반복하고 JSX를 반환함으로써입니다.",
      "for() 루프를 사용하여 데이터 배열을 반복하고 JSX를 반환함으로써입니다.",
      "forEach() 메서드를 사용하여 데이터 배열을 반복하고 JSX를 반환함으로써입니다.",
      "loop() 메서드를 사용하여 데이터 배열을 반복하고 JSX를 반환함으로써입니다.",
    ],
  },
  {
    id: "q7",
    text: "어떤 접근 방식은 조건에 따라 콘텐츠를 렌더링하는 데 사용할 수 없나요?",
    answers: [
      "#if 템플릿 구문을 사용하는 것입니다.",
      "삼항 연산자를 사용하는 것입니다.",
      "&& 연산자를 사용하는 것입니다.",
      "if-else 문을 사용하는 것입니다.",
    ],
  },
];
